hagiu10/Scale_ESP8266/arduino/libraries/webServer/src/webServer.h
#ifndef WEB_SERVER_H
#define WEB_SERVER_H

#include <commonLibs.h>
#include <ESP8266WiFi.h>
#include <ESPAsyncWebServer.h>
#include <LittleFS.h>
#include <micro_sd.h>
#include <rtc.h>
#include <ArduinoJson.h>
#include "../WebPage/webPage.h"

extern AsyncWebServer* server;  // Create a server object on port 80
extern bool apActive;
extern unsigned long apStartTime;

// Function prototypes
class webServer: micro_sd, rtc {
  public:
    webServer();
    static void startAP();
    static void handleAPTimeout();
  private:
    static void init(void);
    static void loadWebPage(void);
    static void setRTCtime(void);
    static void initHandleDataEndpoint(void);
    static void handleDataRequest(AsyncWebServerRequest *request);
    static void sendDataDay(AsyncWebServerRequest *request);
    static void sendDataMonth(AsyncWebServerRequest *request);
    static void sendDataYear(AsyncWebServerRequest *request); 
    static void stopAP(); 
    static void loadChartJS();
};
#endif // WEB_SERVER_H
